In [1]:
import pandas as pd
import numpy as np
from pandas import Series , DataFrame

In [3]:
ser1=Series([0,1,2],index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [4]:
ser2=Series([3,4,5,6],index=['D','E','F','G'])
ser2

D    3
E    4
F    5
G    6
dtype: int64

In [5]:
ser1+ser2

A   NaN
B   NaN
C   NaN
D   NaN
E   NaN
F   NaN
G   NaN
dtype: float64

In [7]:
dframe1= DataFrame(np.arange(4).reshape((2,2)),columns=list('AB'),index=['LA','CG'])
dframe1

    A  B
LA  0  1
CG  2  3

In [8]:
dframe2=DataFrame(np.arange(9).reshape((3,3)),columns=list ('ABC'),index=['LA','CHina','FRAnce'])
dframe2

        A  B  C
LA      0  1  2
CHina   3  4  5
FRAnce  6  7  8

In [9]:
dframe1 + dframe2

          A    B   C
CG      NaN  NaN NaN
CHina   NaN  NaN NaN
FRAnce  NaN  NaN NaN
LA      0.0  2.0 NaN

In [10]:
dframe1

    A  B
LA  0  1
CG  2  3

In [11]:
dframe1.add(dframe2,fill_value=0)

          A    B    C
CG      2.0  3.0  NaN
CHina   3.0  4.0  5.0
FRAnce  6.0  7.0  8.0
LA      0.0  2.0  2.0

In [12]:
dframe2

        A  B  C
LA      0  1  2
CHina   3  4  5
FRAnce  6  7  8